{"modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_28", "layers": [{"name": "input_28", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 64], "dtype": "float32", "sparse": false, "name": "input_28"}, "inbound_nodes": []}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"name": "batch_normalization_97", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_97", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"name": "leaky_re_lu_47", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_47", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_97", 0, 0, {}]]]}, {"name": "reshape_11", "class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "target_shape": [8, 8, -1]}, "inbound_nodes": [[["leaky_re_lu_47", 0, 0, {}]]]}, {"name": "conv2d_transpose_31", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_31", "trainable": true, "filters": 24, "kernel_size": [6, 6], "strides": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_11", 0, 0, {}]]]}, {"name": "conv2d_78", "class_name": "Conv2D", "config": {"name": "conv2d_78", "trainable": true, "filters": 24, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_31", 0, 0, {}]]]}, {"name": "batch_normalization_98", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_98", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_78", 0, 0, {}]]]}, {"name": "activation_51", "class_name": "Activation", "config": {"name": "activation_51", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["batch_normalization_98", 0, 0, {}]]]}, {"name": "conv2d_transpose_32", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_32", "trainable": true, "filters": 48, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_51", 0, 0, {}]]]}, {"name": "conv2d_79", "class_name": "Conv2D", "config": {"name": "conv2d_79", "trainable": true, "filters": 48, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_32", 0, 0, {}]]]}, {"name": "batch_normalization_99", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_99", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_79", 0, 0, {}]]]}, {"name": "activation_52", "class_name": "Activation", "config": {"name": "activation_52", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["batch_normalization_99", 0, 0, {}]]]}, {"name": "conv2d_transpose_33", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_33", "trainable": true, "filters": 80, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_52", 0, 0, {}]]]}, {"name": "conv2d_80", "class_name": "Conv2D", "config": {"name": "conv2d_80", "trainable": true, "filters": 80, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_33", 0, 0, {}]]]}, {"name": "batch_normalization_100", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_100", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_80", 0, 0, {}]]]}, {"name": "activation_53", "class_name": "Activation", "config": {"name": "activation_53", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["batch_normalization_100", 0, 0, {}]]]}, {"name": "conv2d_81", "class_name": "Conv2D", "config": {"name": "conv2d_81", "trainable": true, "filters": 112, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_53", 0, 0, {}]]]}, {"name": "batch_normalization_101", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_101", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_81", 0, 0, {}]]]}, {"name": "activation_54", "class_name": "Activation", "config": {"name": "activation_54", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["batch_normalization_101", 0, 0, {}]]]}, {"name": "conv2d_82", "class_name": "Conv2D", "config": {"name": "conv2d_82", "trainable": true, "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_54", 0, 0, {}]]]}, {"name": "batch_normalization_102", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_102", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_82", 0, 0, {}]]]}, {"name": "activation_55", "class_name": "Activation", "config": {"name": "activation_55", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["batch_normalization_102", 0, 0, {}]]]}], "input_layers": [["input_28", 0, 0]], "output_layers": [["activation_55", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "mean_squared_error", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_100/gamma", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_100/beta", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_100/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_100/moving_variance", "shape": [80], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_101/gamma", "shape": [112], "dtype": "float32"}, {"name": "batch_normalization_101/beta", "shape": [112], "dtype": "float32"}, {"name": "batch_normalization_101/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "batch_normalization_101/moving_variance", "shape": [112], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_102/gamma", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_102/beta", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_102/moving_mean", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_102/moving_variance", "shape": [3], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_97/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_97/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_97/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_97/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_98/gamma", "shape": [24], "dtype": "float32"}, {"name": "batch_normalization_98/beta", "shape": [24], "dtype": "float32"}, {"name": "batch_normalization_98/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "batch_normalization_98/moving_variance", "shape": [24], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_99/gamma", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_99/beta", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_99/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_99/moving_variance", "shape": [48], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv2d_78/kernel", "shape": [5, 5, 24, 24], "dtype": "float32"}, {"name": "conv2d_78/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv2d_79/kernel", "shape": [5, 5, 48, 48], "dtype": "float32"}, {"name": "conv2d_79/bias", "shape": [48], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv2d_80/kernel", "shape": [5, 5, 80, 80], "dtype": "float32"}, {"name": "conv2d_80/bias", "shape": [80], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "conv2d_81/kernel", "shape": [5, 5, 80, 112], "dtype": "float32"}, {"name": "conv2d_81/bias", "shape": [112], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "conv2d_82/kernel", "shape": [1, 1, 112, 3], "dtype": "float32"}, {"name": "conv2d_82/bias", "shape": [3], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "conv2d_transpose_31/kernel", "shape": [6, 6, 24, 16], "dtype": "float32"}, {"name": "conv2d_transpose_31/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv2d_transpose_32/kernel", "shape": [4, 4, 48, 24], "dtype": "float32"}, {"name": "conv2d_transpose_32/bias", "shape": [48], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv2d_transpose_33/kernel", "shape": [4, 4, 80, 48], "dtype": "float32"}, {"name": "conv2d_transpose_33/bias", "shape": [80], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "dense_29/kernel", "shape": [64, 1024], "dtype": "float32"}, {"name": "dense_29/bias", "shape": [1024], "dtype": "float32"}]}]}